src/cf/src/InformationRegisters/РазрешениеНаРедактированиеДокументов/РазрешениеНаРедактированиеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрешениеНаРедактированиеДокументов</name>
  <comment>Разовое разрешение пользователю отредактировать документ в закрытом периоде; гаснет после записи документа</comment>
  <resources>
    <name>КтоРазрешил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРазрешения</name>
    <type>
      <types>DateTime</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИспользования</name>
    <type>
      <types>DateTime</types>
    </type>
  </resources>
  <resources>
    <name>Разрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РедактируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/РазрешениеНаРедактированиеДокументов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Запись.КтоРазрешил) Тогда
		Запись.КтоРазрешил = ПараметрыСеанса.Пользователь;
		Запись.ДатаРазрешения = ТекущаяДатаСеанса();
		Запись.Разрешено = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
